HydroCycloneModelling_UWO/OpenFoam-11_cases/realKE/realKE+kBuoyCurvS+eBuoy/0/U
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      binary;
    class       volVectorField;
    location    "0";
    object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
    inlet
    {
        type            fixedValue;
        value           uniform (-2.32 0 0);
    }
    bottomoutlet
    {
        type            zeroGradient;
    }
    topoutlet
    {
        type            zeroGradient;
    }

    wall
    {
        type            noSlip;
    }

}


// ************************************************************************* //
