HydroCycloneModelling_UWO/OpenFoam-11_cases/realKE/realKE+kBuoyCurvS+eBuoy/constant/momentumTransport
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant";
    object      momentumTransport;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;
ScT             0.07;
RAS
{
    model realizableKE;
    //model    buoyantKEpsilon;

    turbulence      on;
    printCoeffs     off;


     Optional model coefficieints
    Cmu             0.09;
    C1              1.44;
    C2              1.92;
    C3              0.0;
    sigmak          1.0;
    sigmaEps        1.3;

}

// ************************************************************************* //
